"Reload" = "Reload";
"Syncing…" = "Syncing…";
"Select App" = "Select App";
"View" = "View";
"Zoom" = "Zoom";
"Console" = "Console";
"Free Rotation" = "Free Rotation";
"Notifications" = "Notifications";

"Can't see your app ?" = "Can't see your app ?";
"Searching for inspectable apps" = "Searching for inspectable apps";
"1 active app was found" = "1 active app was found";
"%@ active apps were found" = "%@ active apps were found";
"Click the screenshot below to inspect" = "Click the screenshot below to inspect";
"Connection lost" = "Connection lost";
"And no inspectable app was found" = "And no inspectable app was found";
"Click the screenshot below to Change App" = "Click the screenshot below to Change App";
"Other %@ apps were found" = "Other %@ apps were found";
"No inspectable app was found" = "No inspectable app was found";

"Preferences" = "Preferences";
"Appearance" = "Appearance";
"Double click" = "Double click";
"Expand or collapse layer" = "Expand or collapse layer";
"Focus on layer" = "Focus on layer";
"Dark Mode" = "Dark Mode";
"Light Mode" = "Light Mode";
"System Default" = "System Default";
"Color Format" = "Color Format";
"Color will be displayed in format like (255, 12, 34, 0.5). Alpha value is between 0 and 1." = "Color will be displayed in format like (255, 12, 34, 0.5). Alpha value is between 0 and 1.";
"Color will be displayed in format like #7e7e7eff. The components are #RRGGBBAA." = "Color will be displayed in format like #7e7e7eff. The components are #RRGGBBAA.";
"Share analytics with Lookin" = "Share analytics with Lookin";
"Help to improve Lookin by automatically sending diagnostics and usage data." = "Help to improve Lookin by automatically sending diagnostics and usage data.";
"Reset" = "Reset";

"Show layer outline" = "Show layer outline";
"Show hidden UIView and CALayer" = "Show hidden UIView and CALayer";
"Item separation" = "Item separation";
"More…" = "More…";

"Expand recursively" = "Expand recursively";
"Collapse children" = "Collapse children";
"Focus" = "Focus";
"Print" = "Print";
"Hide screenshot this time" = "Hide screenshot this time";
"Hide screenshot forever…" = "Hide screenshot forever…";
"Show screenshot" = "Show screenshot";
"Show layer border" = "Show layer border";
"Copy text \"%@\"" = "Copy text \"%@\"";

"Type property or method name here" = "Type property or method name here";
"Select target object" = "Select target object";
"Objects returned recently in console" = "Objects returned recently in console";
"Objects highlighted in hierarchy panel" = "Objects highlighted in hierarchy panel";
"Automatically make highlighted view in hierarchy panel as console target" = "Automatically make highlighted view in hierarchy panel as console target";
"No object was returned yet" = "No object was returned yet";

"Print stacks when the method you're interested in was invoked." = "Print stacks when the method you're interested in was invoked.";
"Use this tool to debug when Xcode is unavailable, or find method invoker from the class that you cannot easily override." = "Use this tool to debug when Xcode is unavailable, or find method invoker from the class that you cannot easily override.";
"Start" = "Start";
"Add Method" = "Add Method";
"Stack Settings" = "Stack Settings";
"Clear Logs" = "Clear Logs";
"Format stacks and hide frames in system libraries" = "Format stacks and hide frames in system libraries";
"Format stacks and show all frames" = "Format stacks and show all frames";
"Show raw informations" = "Show raw informations";
"Input name of the class you want to monitor" = "Input name of the class you want to monitor";
"Input name of the method you want to monitor" = "Input name of the method you want to monitor";
"Next" = "Next";
"e.g. UIViewController…" = "e.g. UIViewController…";
"e.g. initWithFrame: …" = "e.g. initWithFrame: …";
"Done" = "Done";
"Cancel" = "Cancel";
"Call stacks will appear here when the methods you added are invoked." = "Call stacks will appear here when the methods you added are invoked.";

"Reconnecting…" = "Reconnecting…";
"Change App" = "Change App";
"Image is too large to be displayed." = "Image is too large to be displayed.";
"Currently in focus mode" = "Currently in focus mode";
"The screenshot of selected item is not displayed." = "The screenshot of selected item is not displayed.";
"The screenshot is not displayed due to the config in iOS App." = "The screenshot is not displayed due to the config in iOS App.";
"Details" = "Details";
"Display" = "Display";
"The screenshot of selected %@ is not displayed." = "The screenshot of selected %@ is not displayed.";
"Updating screenshots… %@ / %@" = "Updating screenshots… %@ / %@";
"Do not show again" = "Do not show again";
"You can double-click screenshot to expand or collapse it" = "You can double-click screenshot to expand or collapse it";
"While holding \"Command\" key, you can directly select a screenshot without expanding its superview first" = "While holding \"Command\" key, you can directly select a screenshot without expanding its superview first";
"You can move screenshots by holding \"Space\" key and left mouse button" = "You can move screenshots by holding \"Space\" key and left mouse button";
"You can hide a screenshot in its right-click menu" = "You can hide a screenshot in its right-click menu";
"You can hide the screenshot again in its right-click menu" = "You can hide the screenshot again in its right-click menu";
"You can copy ivar or class name in right-cick menu." = "You can copy ivar or class name in right-cick menu.";
"Inspecting via USB is slower than inspecting a Xcode simulator." = "Inspecting via USB is slower than inspecting a Xcode simulator.";
"Cannot reload at this time" = "Cannot reload at this time";
"Please wait until current sync is completed. You can get sync progress in the upper-left corner of this window." = "Please wait until current sync is completed. You can get sync progress in the upper-left corner of this window.";
"Perhaps your iOS app is paused with breakpoint in Xcode, blocked by other tasks in main thread, or moved to background state." = "Perhaps your iOS app is paused with breakpoint in Xcode, blocked by other tasks in main thread, or moved to background state.";
"Failed to get target object in iOS app" = "Failed to get target object in iOS app";
"Perhaps the related object was deallocated. You can reload Lookin to get newest data." = "Perhaps the related object was deallocated. You can reload Lookin to get newest data.";
"The operation failed due to disconnection with the iOS app." = "The operation failed due to disconnection with the iOS app.";
"The operation failed due to an inner error." = "The operation failed due to an inner error.";
"Request timeout" = "Request timeout";
"Failed to sync screenshots due to the request timeout." = "Failed to sync screenshots due to the request timeout.";
"Failed to sync remaining %@ screenshots due to the request timeout." = "Failed to sync remaining %@ screenshots due to the request timeout.";
"Perhaps your iOS app is paused with breakpoint in Xcode, blocked by other tasks in main thread, or moved to background state.\nToo large screenshots may also lead to this error." = "Perhaps your iOS app is paused with breakpoint in Xcode, blocked by other tasks in main thread, or moved to background state.\nToo large screenshots may also lead to this error.";
"Image Quality:" = "Image Quality:";
"File Size" = "File Size";
"File Size: %.2f M" = "File Size: %.2f M";
"Failed to show framework in Finder" = "Failed to show framework in Finder";
"You can download framework from the url below:" = "You can download framework from the url below:";
"Lost connection with the iOS app." = "Lost connection with the iOS app.";
"Lookin doesn't support adding \"-(void)dealloc\" method." = "Lookin doesn't support adding \"-(void)dealloc\" method.";

"Content is empty." = "Content is empty.";
"You can click \"Pause\" button near the bottom-left corner in Xcode to pause your iOS app, and input in Xcode console like the contents below:\nexpr [((%@ *)%@) %@]" = "You can click \"Pause\" button near the bottom-left corner in Xcode to pause your iOS app, and input in Xcode console like the contents below:\nexpr [((%@ *)%@) %@]";
"Lookin doesn't support invoking methods with arguments yet." = "Lookin doesn't support invoking methods with arguments yet.";
"Lookin doesn't support this syntax yet. Please input a method or property name." = "Lookin doesn't support this syntax yet. Please input a method or property name.";

"The request is discarded due to a newer same request." = "The request is discarded due to a newer same request.";
"iOS App" = "iOS App";

"Current version of Lookin app is too low." = "Current version of Lookin app is too low.";
"Fail to inspect this iOS app due to a version problem." = "Fail to inspect this iOS app due to a version problem.";
"Please update LookinServer.framework linked with target iOS App to a newer version. Visit the website below to get detailed instructions:\nhttps://lookin.work/faq/server-version-too-low/" = "Please update LookinServer.framework linked with target iOS App to a newer version. Visit the website below to get detailed instructions:\nhttps://lookin.work/faq/server-version-too-low/";
"Find solution…" = "Find solution…";
"Target iOS app is linked with a higher version LookinServer.framework. Please click \"Lookin\"-\"Check for Updates\" near the top-left corner or visit https://lookin.work to update your Lookin app." = "Target iOS app is linked with a higher version LookinServer.framework. Please click \"Lookin\"-\"Check for Updates\" near the top-left corner or visit https://lookin.work to update your Lookin app.";
"Unable to inspect this iOS App. Current version of Lookin app is too low." = "Unable to inspect this iOS App. Current version of Lookin app is too low.";
"The version of LookinServer linked with this iOS App is too low." = "The version of LookinServer linked with this iOS App is too low.";

"Could not Move to Applications Folder" = "Could not Move to Applications Folder";
"Do Not Move" = "Do Not Move";
"Some features might not be available if you choose not to." = "Some features might not be available if you choose not to.";
"Move to Applications Folder (Recommended)" = "Move to Applications Folder (Recommended)";
"Move Lookin to Applications folder in your Home folder?" = "Move Lookin to Applications folder in your Home folder?";
"Move Lookin to Applications folder?" = "Move Lookin to Applications folder?";
"Note that this will require an administrator password." = "Note that this will require an administrator password.";
"This will keep your Downloads folder uncluttered." = "This will keep your Downloads folder uncluttered.";

"Your comments or suggestions" = "Your comments or suggestions";
"Your email (optional)" = "Your email (optional)";
"Our email: lookin@lookin.work" = "Our email: lookin@lookin.work";
"Send" = "Send";
"The content is empty." = "The content is empty.";
"Please do not exceed %@ characters" = "Please do not exceed %@ characters";
"Please do not exceed %@ characters about your email address." = "Please do not exceed %@ characters about your email address.";
"Your feedback was sent successfully." = "Your feedback was sent successfully.";
"Failed to send your feedback" = "Failed to send your feedback";
"Please try later or directly send a mail to us: lookin@lookin.work" = "Please try later or directly send a mail to us: lookin@lookin.work";

"The method was invoked successfully and no value was returned." = "The method was invoked successfully and no value was returned.";
"Failed to search related methods: " = "Failed to search related methods: ";
"Click to invoke methods below and get the return value." = "Click to invoke methods below and get the return value.";

"Other…" = "Other…";
"Switch color format to RGBA" = "Switch color format to RGBA";
"Switch color format to HEX" = "Switch color format to HEX";
"The layout of selected view is not affected by this constraint." = "The layout of selected view is not affected by this constraint.";
"Open Image with Preview…" = "Open Image with Preview…";
"The feature is not available in current mode." = "The feature is not available in current mode.";
"You must connect Lookin with target iOS app before using this feature." = "You must connect Lookin with target iOS app before using this feature.";
"Operation failed. The image property value of selected UIImageView is nil." = "Operation failed. The image property value of selected UIImageView is nil.";
"Export screenshot…" = "Export screenshot…";
"Inherits from" = "Inherits from";
"No Filter Results" = "No Filter Results";
"CancelSearch" = "Cancel";
"Will reload in %@ seconds…" = "Will reload in %@ seconds…";
"Measure" = "Measure";
"Hover on a layer" = "Hover on a layer";
"to measure between it and selected %@." = "to measure between it and selected %@.";
"Invalid Size" = "Invalid Size";
"Selected %@'s %@ is less than or equal to 0." = "Selected %@'s %@ is less than or equal to 0.";
"shortcut: holding \"option\" key" = "shortcut: holding \"option\" key";
"Failed to open the document." = "Failed to open the document.";
"The document was created by a Lookin app with too old version. Current Lookin app version is %@, but the document version is %@." = "The document was created by a Lookin app with too old version. Current Lookin app version is %@, but the document version is %@.";
"Current Lookin app is too old to open this document. Current Lookin app version is %@, but the document version is %@." = "Current Lookin app is too old to open this document. Current Lookin app version is %@, but the document version is %@.";
"The file type is not supported." = "The file type is not supported.";
"Filter" = "Filter";
"Only available since macOS 10.14" = "Only available since macOS 10.14";
"The operation failed because target iOS app has entered to the background state." = "The operation failed because target iOS app has entered to the background state.";
"The modification seems to have no effect." = "The modification seems to have no effect.";
"After modifying successfully by Lookin, the value seems to be recovered by the code in your iOS app. For example, modifying \"frame\" of a view may trigger \"layoutSubviews\", and \"layoutSubviews\" may modify the value again." = "After modifying successfully by Lookin, the value seems to be recovered by the code in your iOS app. For example, modifying \"frame\" of a view may trigger \"layoutSubviews\", and \"layoutSubviews\" may modify the value again.";
"Version" = "Version";
"Focused" = "Focused";
"Exit" = "Exit";
"Job openings…(China)" = "Job openings…(China)";
"Clear this message" = "Clear this message";
"No message" = "No message";
"Your iOS project uses an outdated version of the LookinServer SDK. It is recommended to upgrade to the latest version %@" = "Your iOS project uses an outdated version of the LookinServer SDK. It is recommended to upgrade to the latest version %@";
"Your iOS project uses version %@ of the LookinServer SDK, while the latest version online is %@, it is recommended to upgrade." = "Your iOS project uses version %@ of the LookinServer SDK, while the latest version online is %@, it is recommended to upgrade.";
"Check out version updates on GitHub…" = "Check out version updates on GitHub…";
"Your iOS project seems to use Swift, but you haven't turn on Swift optimization for Lookin" = "Your iOS project seems to use Swift, but you haven't turn on Swift optimization for Lookin";
"How to turn on…" = "How to turn on…";
"What do you want to happen when you double click the layer?" = "What do you want to happen when you double click the layer?";
"You can change it at any time in your Preferences." = "You can change it at any time in your Preferences.";
"This object may not be a UIView or CALayer." = "This object may not be a UIView or CALayer.";
"How to add custom properties…" = "How to add custom properties…";
"How to display more member variables…" = "How to display more member variables…";

"Click to view…" = "Click to view…";
"Reveal in panel…" = "Reveal in panel…";
"Image contrast" = "Image contrast";
"Adjust this option to use a deeper layer selection color." = "Adjust this option to use a deeper layer selection color.";
"Normal" = "Normal";
"Medium" = "Medium";
"High" = "High";
"Jump to %@ …" = "Jump to %@ …";
"Navigate…" = "Navigate…";
"Cancel measure after key up." = "Cancel measure after key up.";
"Lookin Documentation Collection" = "Lookin Documentation Collection";
"Fast Mode" = "Fast Mode";
"Request timeout, layer data transmission failed." = "Request timeout, layer data transmission failed.";
"Fast refresh mode is enabled, which may result in layer consistency issues." = "Fast refresh mode is enabled, which may result in layer consistency issues.";
"View feature description" = "View feature description";
"Don't remind me again" = "Don't remind me again";
"Reload layer" = "Reload layer";
"Reload layer and its children" = "Reload layer and its children";
"Operation failed." = "Operation failed.";
"Please upgrade the LookinServer SDK version in your iOS project to 1.2.7 or higher." = "Please upgrade the LookinServer SDK version in your iOS project to 1.2.7 or higher.";
"Some layer data failed to transmit." = "Some layer data failed to transmit.";
"It may be due to changes in the layer structure within the iOS app. You can try reloading the entire structure in Lookin." = "It may be due to changes in the layer structure within the iOS app. You can try reloading the entire structure in Lookin.";
"properties or methods" = "properties or methods";
